import os
from dotenv import load_dotenv

load_dotenv()

BOT_TOKEN = os.getenv("BOT_TOKEN", "")
INITIAL_ADMIN_IDS = list(map(int, os.getenv("INITIAL_ADMIN_IDS", "").split(","))) if os.getenv("INITIAL_ADMIN_IDS") else []

# Список техники
TECH_LIST = [
    "Экск. Погр.",
    "Мини погрузчик",
    "Полноповоротный экс.",
    "Самосвал",
    "Манипулятор",
    "Каток",
    "Асфальтоукладчик",
    "Автогудронатор",
    "Газель г/п",
    "Автокран",
    "Миниэкскаватор",
    "КДМ",
    "МТЗ",
    "Автобус",
]

# Список материалов (быстрый выбор)
MAT_LIST = [
    "Горячая мелкозернистая а/б смесь типа В марки II",
    "Горячая песчаная а/б смесь типа Д марки II",
]

# Список ответственных
RESP_LIST = [
    {"name": "Аллахвердиев Вугар Илгар Оглы", "phone": "+7 (999) 877-77-61"},
    {"name": "Герц Сергей Андреевич",          "phone": "+7 (999) 982-98-88"},
    {"name": "Данилов Владимир Владимирович",   "phone": "+7 (996) 926-14-89"},
    {"name": "Иванов Сергей Геннадьевич",      "phone": "+7 (906) 515-95-06"},
    {"name": "Карташов Артем Юрьевич",         "phone": "+7 (977) 871-67-31"},
    {"name": "Кушнерев Сергей Андреевич",      "phone": "+7 (915) 966-35-35"},
    {"name": "Новиков Денис Дмитриевич",       "phone": "+7 (919) 222-19-86"},
    {"name": "Сорокин Александр Евгеньевич",   "phone": "+7 (965) 346-29-06"},
]

# Константа внизу заявки
CHIEF_NAME = "Нач. уч. Петровский А.М."
CHIEF_PHONE = "8(985)197-31-33"

UNITS = ["шт", "м", "кг", "л", "т", "м²", "м³", "уп"]
